<a id="1"></a>

# <p style="padding: 10px; background-color: orange; margin: 10px; color: #000000; font-family: newtimeroman; font-size: 100%; text-align: center; border-radius: 10px; overflow: hidden; font-weight: 50;">Pandas Basic</p>

<a id="1"></a>
# <p style="padding: 10px; background-color: yellow; margin: 5px; color: #000000; font-family: newtimeroman; font-size: 60%; text-align: right; border-radius: 5px; overflow: hidden; font-weight: 50;">RUSHI BHAMARE</p>

## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

data = [4, 8, 15, 16, 23, 42]
my_series = pd.Series(data)

In [2]:
print(my_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

*****

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
import pandas as pd

my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

my_series = pd.Series(my_list)

In [4]:
print(my_series)

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

## Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [5]:
data = {
    'Name': ['Amit', 'Priya', 'Rajesh', 'Neha', 'Suresh', 'Deepa', 'Sanjay', 'Pooja', 'Vikram', 'Anjali'],
    'City': ['Mumbai', 'Delhi', 'Bangalore', 'Chennai', 'Kolkata', 'Hyderabad', 'Pune', 'Ahmedabad', 'Jaipur', 'Lucknow']
}

In [6]:
# Create a DataFrame
df = pd.DataFrame(data)

In [7]:
print(df)

     Name       City
0    Amit     Mumbai
1   Priya      Delhi
2  Rajesh  Bangalore
3    Neha    Chennai
4  Suresh    Kolkata
5   Deepa  Hyderabad
6  Sanjay       Pune
7   Pooja  Ahmedabad
8  Vikram     Jaipur
9  Anjali    Lucknow

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

#### In Pandas, a DataFrame is a two-dimensional, size-mutable, and heterogeneous tabular data structure. It can be thought of as a spreadsheet or a SQL table, where data is organized into rows and columns. Each column can have a different data type, making it suitable for handling structured data. DataFrames are one of the most commonly used data structures in Pandas.

## DataFrame:

#### 1.Two-dimensional data structure.
#### 2.Can hold multiple columns of data.
#### 3.Columns can have different data types.
#### 4.Has both row and column indices.
##### 5.Suitable for representing and working with structured datasets.

#### On the other hand, a Series is a one-dimensional labeled array-like object in Pandas. It is essentially a single column of data with associated labels or indices. A DataFrame is made up of multiple Series objects, where each Series represents a column. You can think of a Series as a single variable or attribute, whereas a DataFrame contains multiple variables or attributes organized in a tabular format.

In [8]:
# Dataframe

data = {
    'Name': ['Amit', 'Priya', 'Rajesh', 'Neha', 'Suresh', 'Deepa', 'Sanjay', 'Pooja', 'Vikram', 'Anjali'],
    'City': ['Mumbai', 'Delhi', 'Bangalore', 'Chennai', 'Kolkata', 'Hyderabad', 'Pune', 'Ahmedabad', 'Jaipur', 'Lucknow']
}

# Create a DataFrame
df = pd.DataFrame(data)

# Print the DataFrame
print(df)

     Name       City
0    Amit     Mumbai
1   Priya      Delhi
2  Rajesh  Bangalore
3    Neha    Chennai
4  Suresh    Kolkata
5   Deepa  Hyderabad
6  Sanjay       Pune
7   Pooja  Ahmedabad
8  Vikram     Jaipur
9  Anjali    Lucknow

In [9]:
# Series
ages = pd.Series([25, 30, 35, 40, 45], name='Age')
print(ages)

0    25
1    30
2    35
3    40
4    45
Name: Age, dtype: int64

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [10]:
import pandas as pd
import random

names = ['Amit', 'Priya', 'Rajesh', 'Neha', 'Suresh', 'Deepa', 'Sanjay', 'Pooja', 'Vikram', 'Anjali',
                'Rahul', 'Kavita', 'Sunil', 'Meena', 'Arun', 'Swati', 'Vinod', 'Manju', 'Ramesh', 'Sarika',
                'Ravi', 'Sheetal', 'Alok', 'Neelam', 'Mohan']
cities = ['Mumbai', 'Delhi', 'Bangalore', 'Chennai', 'Kolkata', 'Hyderabad', 'Pune', 'Ahmedabad', 'Jaipur', 'Lucknow',
                 'Bhopal', 'Kochi', 'Surat', 'Nagpur', 'Indore', 'Vadodara', 'Coimbatore', 'Ludhiana', 'Agra', 'Varanasi',
                 'Patna', 'Nashik', 'Dehradun', 'Jamshedpur', 'Mysore']
ages = [random.randint(20, 60) for _ in range(25)]

# Create a DataFrame
data = {
    'Name': random.sample(names, 25),
    'City': random.sample(cities, 25),
    'Age': ages
}

df = pd.DataFrame(data)

## Sorting:

#### sort_values(): Sorts the DataFrame by one or more columns.

In [11]:
# Sort the DataFrame by 'Age' in descending order
sorted_data = df.sort_values(by='Age', ascending=False)

In [12]:
print(sorted_data)

       Name        City  Age
8    Sarika       Kochi   59
10     Ravi      Nagpur   59
18     Arun  Jamshedpur   55
13   Kavita    Dehradun   54
7    Vikram    Ludhiana   54
5      Alok     Chennai   52
17   Sanjay        Pune   52
16    Swati        Agra   52
11     Amit      Nashik   52
0     Manju   Bangalore   51
3     Pooja    Vadodara   51
15   Anjali   Ahmedabad   50
19   Neelam     Kolkata   47
12  Sheetal   Hyderabad   47
21   Suresh      Jaipur   42
22    Priya       Patna   42
23     Neha      Mysore   40
6     Vinod       Delhi   36
1     Sunil  Coimbatore   31
2     Rahul      Bhopal   31
24   Rajesh      Mumbai   31
14    Meena     Lucknow   30
20    Deepa       Surat   25
4     Mohan      Indore   24
9    Ramesh    Varanasi   23

## Grouping and Aggregation:

#### groupby(): Groups data based on one or more columns for aggregation.

In [13]:
# Group data by 'City' and calculate the average age in each city
city_avg_age = df.groupby('City')['Age'].mean()

In [14]:
print(city_avg_age)

City
Agra          52.0
Ahmedabad     50.0
Bangalore     51.0
Bhopal        31.0
Chennai       52.0
Coimbatore    31.0
Dehradun      54.0
Delhi         36.0
Hyderabad     47.0
Indore        24.0
Jaipur        42.0
Jamshedpur    55.0
Kochi         59.0
Kolkata       47.0
Lucknow       30.0
Ludhiana      54.0
Mumbai        31.0
Mysore        40.0
Nagpur        59.0
Nashik        52.0
Patna         42.0
Pune          52.0
Surat         25.0
Vadodara      51.0
Varanasi      23.0
Name: Age, dtype: float64

## Aggregation Functions:

#### sum(), mean(), median(), max(), min(), etc.: Compute summary statistics for one or more columns.

In [15]:
# Calculate the mean age of all individuals in the DataFrame
mean_age = df['Age'].mean()
print(mean_age)

43.6

## Data Cleaning:

#### drop(): Remove rows or columns from the DataFrame.

In [16]:
# Remove rows with missing values in any column
cleaned_data = df.dropna()

In [22]:
print(cleaned_data)

       Name        City  Age
0     Manju   Bangalore   51
1     Sunil  Coimbatore   31
2     Rahul      Bhopal   31
3     Pooja    Vadodara   51
4     Mohan      Indore   24
5      Alok     Chennai   52
6     Vinod       Delhi   36
7    Vikram    Ludhiana   54
8    Sarika       Kochi   59
9    Ramesh    Varanasi   23
10     Ravi      Nagpur   59
11     Amit      Nashik   52
12  Sheetal   Hyderabad   47
13   Kavita    Dehradun   54
14    Meena     Lucknow   30
15   Anjali   Ahmedabad   50
16    Swati        Agra   52
17   Sanjay        Pune   52
18     Arun  Jamshedpur   55
19   Neelam     Kolkata   47
20    Deepa       Surat   25
21   Suresh      Jaipur   42
22    Priya       Patna   42
23     Neha      Mysore   40
24   Rajesh      Mumbai   31

## Adding and Deleting Columns:

#### assign(): Add new columns to a DataFrame.
#### drop(): Delete columns from a DataFrame.

In [23]:
df = df.assign(income = [random.randint(40000, 90000) for i in range(25)])

In [21]:
df

    Income  income
0    75951   70048
1    60448   68550
2    46424   61906
3    50437   47078
4    73282   84156
5    65958   72845
6    61991   85989
7    82408   44823
8    51885   71276
9    56800   76094
10   66195   47592
11   77981   78427
12   72798   66899
13   87216   64095
14   84495   72330
15   66118   66113
16   63266   57379
17   62006   62896
18   55078   43920
19   72583   65261
20   76462   68224
21   79422   57403
22   46401   50250
23   88824   84766
24   52892   68829

In [24]:
df = df.drop(columns='income')

In [25]:
df

    Income
0    75951
1    60448
2    46424
3    50437
4    73282
5    65958
6    61991
7    82408
8    51885
9    56800
10   66195
11   77981
12   72798
13   87216
14   84495
15   66118
16   63266
17   62006
18   55078
19   72583
20   76462
21   79422
22   46401
23   88824
24   52892

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

#### Among the options given (Series, DataFrame, Panel), both Series and DataFrame are mutable in nature.

#### Series: A Pandas Series is mutable, meaning you can change its values or modify it after creation. You can update specific elements, append new values, or delete elements from a Series.

#### DataFrame: Similarly, a Pandas DataFrame is mutable. You can modify the data in individual cells, add or remove columns and rows, or perform various data manipulation operations on a DataFrame.

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [28]:
import pandas as pd

# Sample names, ages, and cities in Series
names = pd.Series(['Amit', 'Priya', 'Rajesh', 'Neha', 'Suresh'])
ages = pd.Series([28, 32, 25, 30, 35])
cities = pd.Series(['Mumbai', 'Delhi', 'Bangalore', 'Chennai', 'Kolkata'])

# Create a DataFrame using the Series
data1 = {
    'Name': names,
    'Age': ages,
    'City': cities
}

indian_df = pd.DataFrame(data1)

# Print the DataFrame
print(indian_df)

     Name  Age       City
0    Amit   28     Mumbai
1   Priya   32      Delhi
2  Rajesh   25  Bangalore
3    Neha   30    Chennai
4  Suresh   35    Kolkata